# sendemail/forms.py
from django import forms
from django.core.validators import validate_email
from django.core.validators import RegexValidator

class ContactForm(forms.Form):
 # from_email = forms.EmailField(required=False)
 # subject = forms.CharField(required=False)
 # message = forms.CharField(widget=forms.Textarea, required=False)

 # def clean_message(self):
 #      message=self.cleaned_data['message']
 #      if(message==""):
 #         raise forms.ValidationError("insert data for message")
 #      return message
 # def clean_subject(self):
 #      subject=self.cleaned_data['subject']
 #      if(subject==""):
 #         raise forms.ValidationError("insert data for subject")
 #      return subject
 # def clean_from_email(self):
 #      from_email=self.cleaned_data['from_email']
 #      if(from_email==""):
 #         raise forms.ValidationError("insert data for from_email")
 #      else:
 #      	   validate_email(from_email)
 #      return from_email

 quilification = [['薬剤師', '薬剤師'],['認定薬剤師', '認定薬剤師'],['薬剤師取得見込み（薬学生など）', '薬剤師取得見込み（薬学生など）'],['登録販売者', '登録販売者'],]
 quilcheck_box = forms.MultipleChoiceField(choices=quilification, widget=forms.CheckboxSelectMultiple())

 work_period = [['', '選択してください'],['1ヶ月以内', '1ヶ月以内	'],['3ヶ月以内', '3ヶ月以内'],['6ヶ月以内', '6ヶ月以内'],['6ヶ月より先', '6ヶ月より先'],['良いところが有り次第', '良いところが有り次第'],['未定', '未定']]
 work_period_sele = forms.ChoiceField(choices=work_period, widget=forms.Select())

 employ_type = [['正社員', '正社員'],['契約社員', '契約社員'],['パート', 'パート'],['パート（扶養）', 'パート（扶養）'],['派遣', '派遣'],['紹介予定派遣', '紹介予定派遣']]
 employ_type_box = forms.MultipleChoiceField(choices=employ_type, widget=forms.CheckboxSelectMultiple())

 wanted_place01 = [['', '第1希望'],['こだわらない','こだわらない'],['北海道','北海道'],['青森県','青森県'],['岩手県','岩手県'],['宮城県','宮城県'],['秋田県','秋田県'],['山形県','山形県'],['福島県','福島県'],['茨城県','茨城県'],['栃木県','栃木県'],['群馬県','群馬県'],['埼玉県','埼玉県'],['千葉県','千葉県'],['東京都','東京都'],['神奈川県','神奈川県'],['新潟県','新潟県'],['富山県','富山県'],['石川県','石川県'],['福井県','福井県'],['山梨県','山梨県'],['長野県','長野県'],['岐阜県','岐阜県'],['静岡県','静岡県'],['愛知県','愛知県'],['三重県','三重県'],['滋賀県','滋賀県'],['京都府','京都府'],['大阪府','大阪府'],['兵庫県','兵庫県'],['奈良県','奈良県'],['和歌山県','和歌山県'],['鳥取県','鳥取県'],['島根県','島根県'],['岡山県','岡山県'],['広島県','広島県'],['山口県','山口県'],['徳島県','徳島県'],['香川県','香川県'],['愛媛県','愛媛県'],['高知県','高知県'],['福岡県','福岡県'],['佐賀県','佐賀県'],['長崎県','長崎県'],['熊本県','熊本県'],['大分県','大分県'],['宮崎県','宮崎県'],['鹿児島県','鹿児島県'],['沖縄県','沖縄県'],['海外','海外'],]
 wanted_place_sele01= forms.ChoiceField(choices=wanted_place01, widget=forms.Select())

 wanted_place02 = [['', '第2希望'],['こだわらない','こだわらない'],['北海道','北海道'],['青森県','青森県'],['岩手県','岩手県'],['宮城県','宮城県'],['秋田県','秋田県'],['山形県','山形県'],['福島県','福島県'],['茨城県','茨城県'],['栃木県','栃木県'],['群馬県','群馬県'],['埼玉県','埼玉県'],['千葉県','千葉県'],['東京都','東京都'],['神奈川県','神奈川県'],['新潟県','新潟県'],['富山県','富山県'],['石川県','石川県'],['福井県','福井県'],['山梨県','山梨県'],['長野県','長野県'],['岐阜県','岐阜県'],['静岡県','静岡県'],['愛知県','愛知県'],['三重県','三重県'],['滋賀県','滋賀県'],['京都府','京都府'],['大阪府','大阪府'],['兵庫県','兵庫県'],['奈良県','奈良県'],['和歌山県','和歌山県'],['鳥取県','鳥取県'],['島根県','島根県'],['岡山県','岡山県'],['広島県','広島県'],['山口県','山口県'],['徳島県','徳島県'],['香川県','香川県'],['愛媛県','愛媛県'],['高知県','高知県'],['福岡県','福岡県'],['佐賀県','佐賀県'],['長崎県','長崎県'],['熊本県','熊本県'],['大分県','大分県'],['宮崎県','宮崎県'],['鹿児島県','鹿児島県'],['沖縄県','沖縄県'],['海外','海外'],]
 wanted_place_sele02= forms.ChoiceField(choices=wanted_place02, widget=forms.Select())


 wanted_industry = [['調剤薬局', '調剤薬局'],['ドラッグストア', 'ドラッグストア'],['調剤あり', '調剤あり'],['OTCのみ', 'OTCのみ'],['病院', '病院'],['一般', '一般'],['療養型', '療養型'],['精神科', '精神科'],['クリニック', 'クリニック'],['企業', '企業'],['その他', 'その他'],]
 wanted_industry_box = forms.MultipleChoiceField(choices=wanted_industry, widget=forms.CheckboxSelectMultiple(),required=False)

 name = forms.CharField(required=True)
 kana = forms.CharField(required=True)
 birth_year=[['','選択してください'],['2000','2000'],['1999','1999'],['1998','1998'],['1997','1997'],['1996','1996'],['1995','1995'],['1994','1994'],['1993','1993'],['1992','1992'],['1991','1991'],['1990','1990'],['1989','1989'],['1988','1988'],['1987','1987'],['1986','1986'],['1985','1985'],['1984','1984'],['1983','1983'],['1982','1982'],['1981','1981'],['1980','1980'],['1979','1979'],['1978','1978'],['1977','1977'],['1976','1976'],['1975','1975'],['1974','1974'],['1973','1973'],['1972','1972'],['1971','1971'],['1970','1970'],['1969','1969'],['1968','1968'],['1967','1967'],['1966','1966'],['1965','1965'],['1964','1964'],['1963','1963'],['1962','1962'],['1961','1961'],['1960','1960'],['1959','1959'],['1958','1958'],['1957','1957'],['1956','1956'],['1955','1955'],['1954','1954'],['1953','1953'],['1952','1952'],['1951','1951'],['1950','1950'],['1949','1949'],['1948','1948'],['1947','1947'],['1946','1946'],['1945','1945'],]
 birth_yearsele=forms.ChoiceField(choices=birth_year, widget=forms.Select())
 birth_month=[['','月'],['1','1'],['2','2'],['3','3'],['4','4'],['5','5'],['6','6'],['7','7'],['8','8'],['9','9'],['10','10'],['11','11'],['12','12'],]
 birth_monthsele=forms.ChoiceField(choices=birth_month, widget=forms.Select())
 birth_day=[['','日'],['1','1'],['2','2'],['3','3'],['4','4'],['5','5'],['6','6'],['7','7'],['8','8'],['9','9'],['10','10'],['11','11'],['12','12'],['13','13'],['14','14'],['15','15'],['16','16'],['17','17'],['18','18'],['19','19'],['20','20'],['21','21'],['22','22'],['23','23'],['24','24'],['25','25'],['26','26'],['27','27'],['28','28'],['29','29'],['30','30'],['31','31'],]
 birth_daysele=forms.ChoiceField(choices=birth_day, widget=forms.Select())
 address01 = [['', '都道府県'],['北海道','北海道'],['青森県','青森県'],['岩手県','岩手県'],['宮城県','宮城県'],['秋田県','秋田県'],['山形県','山形県'],['福島県','福島県'],['茨城県','茨城県'],['栃木県','栃木県'],['群馬県','群馬県'],['埼玉県','埼玉県'],['千葉県','千葉県'],['東京都','東京都'],['神奈川県','神奈川県'],['新潟県','新潟県'],['富山県','富山県'],['石川県','石川県'],['福井県','福井県'],['山梨県','山梨県'],['長野県','長野県'],['岐阜県','岐阜県'],['静岡県','静岡県'],['愛知県','愛知県'],['三重県','三重県'],['滋賀県','滋賀県'],['京都府','京都府'],['大阪府','大阪府'],['兵庫県','兵庫県'],['奈良県','奈良県'],['和歌山県','和歌山県'],['鳥取県','鳥取県'],['島根県','島根県'],['岡山県','岡山県'],['広島県','広島県'],['山口県','山口県'],['徳島県','徳島県'],['香川県','香川県'],['愛媛県','愛媛県'],['高知県','高知県'],['福岡県','福岡県'],['佐賀県','佐賀県'],['長崎県','長崎県'],['熊本県','熊本県'],['大分県','大分県'],['宮崎県','宮崎県'],['鹿児島県','鹿児島県'],['沖縄県','沖縄県'],['海外','海外'],]
 address01_sele= forms.ChoiceField(choices=address01, widget=forms.Select())

 address02 = forms.CharField(required=True)
 phone_regex = RegexValidator(regex=r'^\+?1?\d{9,15}$', message="電話番号はハイフンと数字のみで入力して下さい。")
 tel = forms.CharField(validators=[phone_regex], max_length=17, required=True) # validators should be a list
 from_email = forms.EmailField(required=True)
 message = forms.CharField(widget=forms.Textarea, required=False)